---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalMember.GetReleaseType(System.Boolean)
source: html/3cd5237d-bef2-7a12-f0e3-43318820f75a.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalMember.GetReleaseType Method

Gets the release type.

## Syntax (C#)
```csharp
public ReleaseType GetReleaseType(
	bool start
)
```

## Parameters
- **start** (`System.Boolean`) - The position on Analytical Member element. True for start, false for end.

## Returns
The type of release.